import Footer from "../components/FooterComp";
import { useEffect, useState } from "react";
import AccordionItem from "../components/Faq";
import Navbar from "../components/Navbar";
import AOS from "aos";
import "../css/about.css";
import "aos/dist/aos.css";
function About() {
  const questions = [
    {
      question: "ვინ ვართ ჩვენ?",
      answer:
        "ჩვენ ვართ ახალი საფეხბურთო აკადემია, რომელიც შექმნილია 6-დან 12 წლამდე ასაკის ბავშვებისთვის.ჩვენი მიზანია, რომ პატარა ფეხბურთის მოყვარულებს მივცეთ საშუალება განივითარონ ტექნიკური უნარები, სპორტული დისციპლინა და გუნდურობა. ჩვენი ტრენერები ზრუნავენ იმაზე, რომ ბავშვებმა იგრძნონ თავს უსაფრთხოდ, დაიმეგობრონ თანატოლებთან და სპორტი გახდეს მათთვის სასიამოვნო გამოცდილება. ⚽ ",
    },
    {
      question: "რამდენის წლისას შეუძლია დარეგისტრირება?",
      answer:
        "ჩვენ გუნდში დარეგისტრირება შეუძლიათ 6-დან 12 წლამდე ასაკის ბიჭებს, რომლებიც დაინტერესებული არიან ფეხბურთით და სურთ გახდნენ მეგობრული და სპორტული გარემოს ნაწილი.",
    },
    {
      question: "როგორ დავრეგისტრიდე?",
      answer:
        "მთავარ გვერძე რეგისტრაციის ღილაკზე დაჭერით გადაგიყვანს სარეგისტრაციო გვერძე ინფორმაციის შეყვანის შემდეგ ჩვენი ერთ-ერთი სტაფის წევრი დაგიკავშირდებათ და გაგაცნობთ დეტალებს",
    },

    {
      question: "სად ტარდება ვარჯიშები??",
      answer: "ვარჯიშები ტარდება [მოედნის/სპორტული სკოლის] ტერიტორიაზე",
    },
    {
      question: "უნდა ჰქონდეს ბავშვებს საკუთარი ინვენტარი?",
      answer:
        "სასურველია თავიდან სპორტული ფორმა და ფეხსაცმელი. ბურთებსა და სხვა საჭირო ინვენტარს გუნდი უზრუნველყოფს.",
    },
    {
      question: "შემიძლია ბავშვის მოყვანა საცდელ ვარჯიშზე?",
      answer:
        "დიახ! გთავაზობთ ერთ საცდელ ვარჯიშს, რათა ბავშვმა და მშობელმა უკეთ გაიგონ გარემო და პროცესი.",
    },
    {
      question: "რამდენია გადასახადი?",
      answer: "საგადასახადო დეტალებს მწვრთნელი ან გუნდის წევრი გაგაცნობთ.",
    },
  ];

 const [show , setShow] = useState(false)

 useEffect(()=> (
  setShow(true)
 ), [])
  useEffect(() => {
    AOS.init({ duration: 1000, once: true }); // once = animate only on first scroll
  }, []);



  const [openT, setOpen] = useState(null);

  return (
    <div>
      <Navbar />
      <div className="about-head">
        <div className="about-heading">
          <h1  data-aos="fade-up" data-aos-delay="200">ჩვენს შესახებ</h1>
        </div>
        <div className={`about-wrapper ${show ? " show" : ""}`} >
          <div className="about-text">
            <p data-aos="fade-up" data-aos-delay="200">
              ჩვენი გუნდი არის ახალგაზრდული საფეხბურთო კლუბი, რომელიც
              ორიენტირებულია 6-დან 12 წლამდე ბავშვებზე. ჩვენი მთავარი მიზანია
              არა მხოლოდ ფეხბურთის სათანადო სწავლება, არამედ ბავშვების ფიზიკური
              განვითარება, გუნდური მუშაობის უნარის გაძლიერება და ჯანმრთელი
              ცხოვრების წესის ჩამოყალიბება. ჩვენ დარწმუნებულნი ვართ, რომ სპორტი
              არის საუკეთესო გზა, რათა ბავშვებმა ისწავლონ დისციპლინა,
              თანამშრომლობა, პასუხისმგებლობა და ერთობლივი მიზნის მიღწევა.
              <br></br>
              <br></br>
              
              
              
              თითოეული ბავშვი ინდივიდუალურად იქნება დაკვირვების ქვეშ, რათა მისი უნარები
              სრულად განვითარდეს. ჩვენ მხარს ვუჭერთ არა მხოლოდ ტექნიკურ
              უნარებს, არამედ ასევე მორალურ განვითარებას, რათა
              ბავშვებმა გაიუმჯობესონ კომუნიკაციის უნარები, ავტონომია და
              თვითრწმენა.<br></br>
              <br></br>
              ჩვენი ტრენინგები მოიცავს როგორც ფუნდამენტური ფეხბურთის ტექნიკას,
              ასევე ფიზიკური აქტივობის მრავალფეროვან ფორმებს. ბავშვები სწავლობენ
              ბურთის კონტროლს, პასის ტექნიკას, დარტყმას, ტაქტიკას და გუნდურ
              თამაშს. ტრენინგები დაგეგმილია ისე, რომ იყოს სახალისო, ენერგიული და
              ინტერაქტიული, რათა ბავშვებს ჰქონდეთ მაქსიმალური მოტივაცია.<br></br>
              <br></br>
              გარდა ტრენინგებისა, ჩვენ რეგულარულად მოვაწყობთ მეგობრულ მატჩებს სხვა
              კლუბებთან, რათა ბავშვებმა რეალურ თამაშში გამოიყენონ ის, რაც
              ისწავლეს. ჩვენ ვანიჭებთ მნიშვნელობას არა მხოლოდ გამარჯვებას, არამედ
              სწორი თამაშის პრინციპებს, გუნდურ მუშაობას და სპორტული ეთიკის
              დაცვას.<br></br>
              <br></br>
              ჩვენი კლუბი ასევე ცდილობს ჩართოს მშობლები გუნდის აქტივობაში.
              რეგულარული შეხვედრები, განახლებები და შეხვედრები მწვრთნელებთან
              საშუალებას აძლევს მშობლებს გააცნობიერონ ბავშვების პროგრესი და
              აქტიურად იყვნენ ჩართულები მათი განვითარების პროცესში. ჩვენ ვქმნით
              გარემოს, სადაც ბავშვები თავს უსაფრთხოდ და თავისუფლად იგრძნობენ.<br></br>
              <br></br>
              ჩვენი მისიაა ბავშვებს არა მხოლოდ პროფესიონალური ფეხბურთის სწავლება, არამედ ყურადღება მიექცევა ბავშვის განათლებასაც, გუნდის სამწვრთნელო წევრები დააკვირდებიან ბავშვების სკოლის განათლებასაც, რათა ბავშვმა უფრო მეტი ყურადღება არ გადაიტანოს მხოლოდ ფეხბურთზე.<br></br>
              <br></br>
              ჩვენი კლუბის მთავარი პრიორიტეტია ყოველი ბავშვის ინდივიდუალური
              საჭიროებების გათვალისწინება, მათი ნიჭის და უნარების მაქსიმალური
              განვითარება და სიხალისის შექმნა სპორტული გარემოში. ჩვენ ვამაყობთ
              ჩვენი გუნდის მიღწევებით და ვაგრძელებთ მუდმივად დახვეწას, რათა
              ბავშვებს მივცეთ საუკეთესო გამოცდილება საფეხბურთო სამყაროში.
            </p>
          </div>

          <div className="faq" data-aos="fade-up" data-aos-delay="200">
            <h2>ხშირად დასმული კითხვები</h2>
            {questions.map((faq, idx) => (
              <AccordionItem
                key={idx}
                question={faq.question}
                answer={faq.answer}
                open={openT === idx}
                onClick={() => setOpen(openT === idx ? null : idx)}
              />
            ))}
          </div>
        </div>

        <Footer />
      </div>
    </div>
  );
}

export default About;
